html/docker/kubernates-handbook/manual/cluster/kubeconfig.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>使用 kubeconfig 文件配置跨集群认证</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="../../css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="visit.html"> UP </a>
 |
 <a accesskey="H" href="cluster.html"> HOME </a>
</div><div id="content">
<h1 class="title">使用 kubeconfig 文件配置跨集群认证</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9b01db7">组成</a>
<ul>
<li><a href="#org2180bf7">示例</a></li>
<li><a href="#org36b4086">组件</a>
<ul>
<li><a href="#orgb650db5">Cluster</a></li>
<li><a href="#org37e4149">user</a></li>
<li><a href="#orgb98f17c">context</a></li>
<li><a href="#org6156910">current-context</a></li>
<li><a href="#org29eaf7f">杂项</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org889a3f3">查看</a></li>
</ul>
</div>
</div>
<p>
Kubernetes 的认证方式对于不同的人来说可能有所不同：
</p>
<ul class="org-ul">
<li>运行 kubelet 可能有一种认证方式（即证书）</li>
<li>用户可能有不同的认证方式（即令牌）</li>
<li>管理员可能具有他们为个人用户提供的证书列表</li>
<li>可能有多个集群，并希望在同一个地方将其全部定义，这样用户就能使用自己的证书并重用相同的全局配置</li>
</ul>

<pre class="example" id="org8b519fe">
所以为了能够让用户轻松地在多个集群之间切换，对于多个用户的情况下，将其定义在了一个 kubeconfig 文件中

</pre>
<p>
此文件包含一系列与 <span class="underline">昵称</span> 相关联的 <span class="underline">身份验证机制</span> 和 <span class="underline">集群连接</span> 信息。它还引入了一个（用户） <span class="underline">认证信息元组</span> 和一个被称为 <span class="underline">上下文</span> 的与昵称相关联的集群连接信息的概念
</p>

<pre class="example" id="org5c2057d">
如果明确指定，则允许使用多个 kubeconfig 文件。在运行时，它们与命令行中指定的覆盖选项一起加载并合并
</pre>
<div id="outline-container-org9b01db7" class="outline-2">
<h2 id="org9b01db7">组成</h2>
<div class="outline-text-2" id="text-org9b01db7">
</div>
<div id="outline-container-org2180bf7" class="outline-3">
<h3 id="org2180bf7">示例</h3>
<div class="outline-text-3" id="text-org2180bf7">
<pre class="example" id="org6a136a4">
current-context: federal-context
apiVersion: v1
clusters:
- cluster:
    api-version: v1
    server: http://cow.org:8080
  name: cow-cluster
- cluster:
    certificate-authority: path/to/my/cafile
    server: https://horse.org:4443
  name: horse-cluster
- cluster:
    insecure-skip-tls-verify: true
    server: https://pig.org:443
  name: pig-cluster
contexts:
- context:
    cluster: horse-cluster
    namespace: chisel-ns
    user: green-user
  name: federal-context
- context:
    cluster: pig-cluster
    namespace: saw-ns
    user: black-user
  name: queen-anne-context
kind: Config
preferences:
  colors: true
users:
- name: blue-user
  user:
    token: blue-token
- name: green-user
  user:
    client-certificate: path/to/my/client/cert
    client-key: path/to/my/client/key
</pre>
</div>
</div>
<div id="outline-container-org36b4086" class="outline-3">
<h3 id="org36b4086">组件</h3>
<div class="outline-text-3" id="text-org36b4086">
</div>
<div id="outline-container-orgb650db5" class="outline-4">
<h4 id="orgb650db5">Cluster</h4>
<div class="outline-text-4" id="text-orgb650db5">
<pre class="example" id="org23c034f">
clusters:
- cluster:
    certificate-authority: path/to/my/cafile
    server: https://horse.org:4443
  name: horse-cluster
- cluster:
    insecure-skip-tls-verify: true
    server: https://pig.org:443
  name: pig-cluster
</pre>

<p>
cluster 中包含 kubernetes <span class="underline">集群的端点数据</span> 包括 ：
</p>
<ul class="org-ul">
<li>kubernetes apiserver 的完整 url</li>
<li>集群的证书颁发机构
<ul class="org-ul">
<li>当集群的服务证书未被系统信任的证书颁发机构签名时，设置 <span class="underline">insecure-skip-tls-verify: true</span></li>
</ul></li>
</ul>

<p>
cluster 的名称（昵称）作为该 kubeconfig 文件中的 <span class="underline">集群字典</span> 的 <span class="underline">key</span> 
</p>

<pre class="example" id="orgb3892de">
可以使用 kubectl config set-cluster添加或修改 cluster 条目
</pre>
</div>
</div>
<div id="outline-container-org37e4149" class="outline-4">
<h4 id="org37e4149">user</h4>
<div class="outline-text-4" id="text-org37e4149">
<pre class="example" id="org1724f23">
users:
- name: blue-user
  user:
    token: blue-token
- name: green-user
  user:
    client-certificate: path/to/my/client/cert
    client-key: path/to/my/client/key
</pre>

<p>
user 定义用于向 kubernetes 集群进行 <span class="underline">身份验证的客户端凭据</span> ：
</p>
<ul class="org-ul">
<li>在加载/合并 kubeconfig 之后，user 将有一个名称（昵称）作为 <span class="underline">用户条目列表</span> 中的 <span class="underline">key</span></li>
<li>可用凭证有 <span class="underline">client-certificate</span> 、 <span class="underline">client-key</span> 、 <span class="underline">token</span> 和 <span class="underline">username/password</span>
<ul class="org-ul">
<li>username/password 和 token 是二者只能选择一个</li>
<li>client-certificate 和 client-key 可以分别与它们组合</li>
</ul></li>
</ul>

<pre class="example" id="org291ffba">
可以使用 kubectl config set-credentials 添加或者修改 user 条目
</pre>
</div>
</div>
<div id="outline-container-orgb98f17c" class="outline-4">
<h4 id="orgb98f17c">context</h4>
<div class="outline-text-4" id="text-orgb98f17c">
<pre class="example" id="org6b7f2fc">
contexts:
- context:
    cluster: horse-cluster
    namespace: chisel-ns
    user: green-user
  name: federal-context
</pre>

<p>
context 定义了一个命名的 <span class="underline">cluster</span> 、 <span class="underline">user</span> 、 <span class="underline">namespace</span> 元组，用于 <b>使用提供的认证信息和命名空间将请求发送到指定的集群</b> ：
</p>
<ul class="org-ul">
<li>三个都是 <span class="underline">可选的</span> ：仅使用 cluster、user、namespace 之一指定上下文，或指定 <span class="underline">none</span> 
<ul class="org-ul">
<li><p>
未指定的值或在加载的 kubeconfig 中没有相应条目的命名值将被替换为默认值
</p>
<pre class="example" id="org585a666">
例如，如果为上述 kubeconfig 文件指定了 pink-user 的上下文
</pre></li>
</ul></li>
</ul>

<pre class="example" id="orgdf1d35c">
可以使用 kubectl config set-context 添加或修改上下文条目
</pre>
</div>
</div>
<div id="outline-container-org6156910" class="outline-4">
<h4 id="org6156910">current-context</h4>
<div class="outline-text-4" id="text-org6156910">
<pre class="example" id="org7ee495b">
current-context: federal-context
</pre>

<p>
current-context 是昵称或者说是作为 cluster、user、namespace 元组的 ”key“，当 kubectl 从该文件中加载配置的时候会被 <b>默认</b> 使用
</p>

<pre class="example" id="org60b5cc1">
可以在 kubectl 命令行里覆盖这些值，通过分别传入 —context=CONTEXT、 —cluster=CLUSTER、--user=USER 和 --namespace=NAMESPACE 

可以使用 kubectl config use-context 更改 current-context
</pre>
</div>
</div>
<div id="outline-container-org29eaf7f" class="outline-4">
<h4 id="org29eaf7f">杂项</h4>
<div class="outline-text-4" id="text-org29eaf7f">
<pre class="example" id="org1d8d5ab">
apiVersion: v1
kind: Config
preferences:
  colors: true
</pre>

<ul class="org-ul">
<li>apiVersion 和 kind 标识客户端解析器的版本和模式，不应手动编辑</li>
<li>preferences 指定可选（和当前未使用）的 kubectl 首选项</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org889a3f3" class="outline-2">
<h2 id="org889a3f3">查看</h2>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
